УТ/src/Documents/АУ_РеестрПлатежей/АУ_РеестрПлатежей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АУ_РеестрПлатежей</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникКонтроля</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Платежи</name>
    <attributes>
      <name>ЗаявкаНаРасходованиеДенежныхСредств</name>
      <type>
        <types>DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ/src/Documents/АУ_РеестрПлатежей/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЗаявкиКОплате";
	КомандаПечати.Представление = НСтр("ru = 'Заявки к оплате'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаявкиКОплате") Тогда

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ЗаявкиКОплате",
				НСтр("ru = 'Реестр платежей'"),
				ПечатьЗаявкиКОплате(МассивОбъектов, ОбъектыПечати));

	КонецЕсли;
			
	ФормированиеПечатныхФорм.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

Функция ДоступныеДляШаблоновПечатныеФормы() Экспорт
	
	МассивДоступныхПечатныхФорм = Новый Массив;
	
	Возврат МассивДоступныхПечатныхФорм

КонецФункции

Функция ПечатьЗаявкиКОплате(МассивОбъектов, ОбъектыПечати)
	
	ЗапросПоДокументам = Новый Запрос;
	ЗапросПоДокументам.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	ЗапросПоДокументам.Текст =
	"ВЫБРАТЬ
	|	АУ_РеестрПлатежейПлатежи.Ссылка КАК Ссылка,
	|	АУ_РеестрПлатежейПлатежи.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств,
	|	АУ_РеестрПлатежейПлатежи.Комментарий КАК Комментарий,
	|	АУ_РеестрПлатежейПлатежи.ЗаявкаНаРасходованиеДенежныхСредств.СуммаДокумента КАК Сумма,
	|	АУ_РеестрПлатежейПлатежи.ЗаявкаНаРасходованиеДенежныхСредств.Валюта КАК Валюта,
	|	АУ_РеестрПлатежейПлатежи.ЗаявкаНаРасходованиеДенежныхСредств.Контрагент КАК Контрагент,
	|	АУ_РеестрПлатежейПлатежи.ЗаявкаНаРасходованиеДенежныхСредств.Номер КАК Номер,
	|	АУ_РеестрПлатежейПлатежи.ЗаявкаНаРасходованиеДенежныхСредств.НазначениеПлатежа КАК НазначениеПлатежа,
	|	АУ_РеестрПлатежейПлатежи.ЗаявкаНаРасходованиеДенежныхСредств.ДатаПлатежа КАК Дата
	|ИЗ
	|	Документ.АУ_РеестрПлатежей.Платежи КАК АУ_РеестрПлатежейПлатежи
	|ГДЕ
	|	АУ_РеестрПлатежейПлатежи.Ссылка В(&МассивОбъектов)
	|ИТОГИ ПО
	|	Ссылка";

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АУ_РеестрПлатежей";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.АУ_РеестрПлатежей.Макет");
	
	ПервыйДокумент = Истина;
	ВыборкаДокументы = ЗапросПоДокументам.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДокументы.Следующий() Цикл
		
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		// Вывод заголовка.
		ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
		ТабДокумент.Вывести(ОбластьМакета);
		
		// Вывод строк документа.
		ВыборкаПоСтрокам = ВыборкаДокументы.Выбрать();
		
		Пока ВыборкаПоСтрокам.Следующий() Цикл
			
			ОбластьМакета = Макет.ПолучитьОбласть("Строка");
			ОбластьМакета.Параметры.Заполнить(ВыборкаПоСтрокам);
			
			Для каждого стр Из ВыборкаПоСтрокам.ЗаявкаНаРасходованиеДенежныхСредств.АУ_СтатьиБюджета Цикл
				
				ОбластьМакета.Параметры.Программа = стр.Программа;
				ОбластьМакета.Параметры.Признак = стр.СтатьяБюджета.ПризнакРасходов;
				ОбластьМакета.Параметры.Контракт = стр.НомерКонтракта;
				Если ЗначениеЗаполнено(стр.ОбъектСтрока) Тогда
					ОбластьМакета.Параметры.Объект = стр.ОбъектСтрока;
				Иначе
					ОбластьМакета.Параметры.Объект = стр.Объект;
				КонецЕсли;
				
				Если ВыборкаПоСтрокам.ЗаявкаНаРасходованиеДенежныхСредств.АУ_СтатьиБюджета.Количество() > 1 Тогда
					ОбластьМакета.Параметры.ЧастнаяСумма = стр.Сумма;
				Иначе
					ОбластьМакета.Параметры.ЧастнаяСумма = 0;
				КонецЕсли;
				ОбластьМакета.Параметры.Комментарий = стр.Комментарий;
				ТабДокумент.Вывести(ОбластьМакета);
				
				ОбластьМакета = Макет.ПолучитьОбласть("Строка");
				
			КонецЦикла;
			
			Если ВыборкаПоСтрокам.ЗаявкаНаРасходованиеДенежныхСредств.АУ_СтатьиБюджета.Количество() = 0 Тогда
				ТабДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
			
		КонецЦикла;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаДокументы.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции

#КонецОбласти

#КонецЕсли
